using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Lesson_0009_var_after_and_before_build
{
    class Program
    {
        static void Main(string[] args)
        {
            //byte num1; بني هذا المتغير قبل بناء لغه السي شارب
            //Byte num2; بني هذا المتغير بعد بناء لغه السي شارب

            //sbyte num3; بني هذا المتغير قبل بناء لغه السي شارب
            //SByte num4; بني هذا المتغير بعد بناء لغه السي شارب


            //short num5; بني هذا المتغير قبل بناء لغه السي شارب
            //Int16 num6; بني هذا المتغير بعد بناء لغه السي شارب


            //ushort num7; بني هذا المتغير قبل بناء لغه السي شارب
            //UInt16 num8; بني هذا المتغير بعد بناء لغه السي شارب


            //int num9; بني هذا المتغير قبل بناء لغه السي شارب
            //Int32 num10; بني هذا المتغير بعد بناء لغه السي شارب


            //uint num11; بني هذا المتغير قبل بناء لغه السي شارب
            //UInt32 num12; بني هذا المتغير بعد بناء لغه السي شارب


            //long num13; بني هذا المتغير قبل بناء لغه السي شارب
            //Int64 num14; بني هذا المتغير بعد بناء لغه السي شارب


            //float num15; بني هذا المتغير قبل بناء لغه السي شارب
            //Single num16; بني هذا المتغير بعد بناء لغه السي شارب


            //double num17; بني هذا المتغير قبل بناء لغه السي شارب
            //Double num18; بني هذا المتغير بعد بناء لغه السي شارب


            //decimal num19; بني هذا المتغير قبل بناء لغه السي شارب
            //Decimal num20; بني هذا المتغير بعد بناء لغه السي شارب



            //char x; بني هذا المتغير قبل بناء لغه السي شارب
            //Char x1; بني هذا المتغير بعد بناء لغه السي شارب


            //string a; بني هذا المتغير قبل بناء لغه السي شارب
            //String a1; بني هذا المتغير بعد بناء لغه السي شارب


            //object ops; بني هذا المتغير قبل بناء لغه السي شارب
            //Object OPS; بني هذا المتغير بعد بناء لغه السي شارب


            //bool t; بني هذا المتغير قبل بناء لغه السي شارب
            //Boolean t1; بني هذا المتغير بعد بناء لغه السي شارب



        }
    }
}
